"1 100 1 4206624770 ,"
"actual_input_1 1 3 112 112 ,"
" 335 337 339 341 343 345 347 349 351 353 355 357 359 361 362 364 366 368 370 372 373 375 377 379 381 383 384 386 388 390 392 394 395 397 399 401 403 405 407 409 411 413 415 416 418 420 422 424 426 427 429 431 433 435 437 438 440 442 444 446 448 449 451 453 455 457 459 460 462 464 466 468 470 471 473 475 477 479 481 483 485 487 489 491 492 494 496 498 500 502 503 505 507 509 517 519 520 521 actual_input_1 output1 ,"
"output1 ,"
" 99 ,"
"Convolution Conv_0 1 1 actual_input_1 335 1 3 64 3 3 2 2 1 1 1 -1 1 1 ,"
"PReLU PRelu_2 1 1 335 337 0 0 ,"
"Convolution Conv_3 1 1 337 339 64 1 64 3 3 1 1 1 1 1 -1 1 1 ,"
"PReLU PRelu_5 1 1 339 341 0 0 ,"
"Convolution Conv_6 1 1 341 343 1 64 128 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU PRelu_8 1 1 343 345 0 0 ,"
"Convolution Conv_9 1 1 345 347 128 1 128 3 3 2 2 1 1 1 -1 1 1 ,"
"PReLU PRelu_11 1 1 347 349 0 0 ,"
"Convolution Conv_12 1 1 349 351 1 128 64 1 1 1 1 0 0 1 -1 1 1 ,"
"Convolution Conv_14 1 1 351 353 1 64 128 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU PRelu_16 1 1 353 355 0 0 ,"
"Convolution Conv_17 1 1 355 357 128 1 128 3 3 1 1 1 1 1 -1 1 1 ,"
"PReLU PRelu_19 1 1 357 359 0 0 ,"
"Convolution Conv_20 1 1 359 361 1 128 64 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_22 2 1 351 361 362 ,"
"Convolution Conv_23 1 1 362 364 1 64 128 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU PRelu_25 1 1 364 366 0 0 ,"
"Convolution Conv_26 1 1 366 368 128 1 128 3 3 1 1 1 1 1 -1 1 1 ,"
"PReLU PRelu_28 1 1 368 370 0 0 ,"
"Convolution Conv_29 1 1 370 372 1 128 64 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_31 2 1 362 372 373 ,"
"Convolution Conv_32 1 1 373 375 1 64 128 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU PRelu_34 1 1 375 377 0 0 ,"
"Convolution Conv_35 1 1 377 379 128 1 128 3 3 1 1 1 1 1 -1 1 1 ,"
"PReLU PRelu_37 1 1 379 381 0 0 ,"
"Convolution Conv_38 1 1 381 383 1 128 64 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_40 2 1 373 383 384 ,"
"Convolution Conv_41 1 1 384 386 1 64 128 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU PRelu_43 1 1 386 388 0 0 ,"
"Convolution Conv_44 1 1 388 390 128 1 128 3 3 1 1 1 1 1 -1 1 1 ,"
"PReLU PRelu_46 1 1 390 392 0 0 ,"
"Convolution Conv_47 1 1 392 394 1 128 64 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_49 2 1 384 394 395 ,"
"Convolution Conv_50 1 1 395 397 1 64 256 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU PRelu_52 1 1 397 399 0 0 ,"
"Convolution Conv_53 1 1 399 401 256 1 256 3 3 2 2 1 1 1 -1 1 1 ,"
"PReLU PRelu_55 1 1 401 403 0 0 ,"
"Convolution Conv_56 1 1 403 405 1 256 128 1 1 1 1 0 0 1 -1 1 1 ,"
"Convolution Conv_58 1 1 405 407 1 128 256 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU PRelu_60 1 1 407 409 0 0 ,"
"Convolution Conv_61 1 1 409 411 256 1 256 3 3 1 1 1 1 1 -1 1 1 ,"
"PReLU PRelu_63 1 1 411 413 0 0 ,"
"Convolution Conv_64 1 1 413 415 1 256 128 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_66 2 1 405 415 416 ,"
"Convolution Conv_67 1 1 416 418 1 128 256 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU PRelu_69 1 1 418 420 0 0 ,"
"Convolution Conv_70 1 1 420 422 256 1 256 3 3 1 1 1 1 1 -1 1 1 ,"
"PReLU PRelu_72 1 1 422 424 0 0 ,"
"Convolution Conv_73 1 1 424 426 1 256 128 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_75 2 1 416 426 427 ,"
"Convolution Conv_76 1 1 427 429 1 128 256 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU PRelu_78 1 1 429 431 0 0 ,"
"Convolution Conv_79 1 1 431 433 256 1 256 3 3 1 1 1 1 1 -1 1 1 ,"
"PReLU PRelu_81 1 1 433 435 0 0 ,"
"Convolution Conv_82 1 1 435 437 1 256 128 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_84 2 1 427 437 438 ,"
"Convolution Conv_85 1 1 438 440 1 128 256 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU PRelu_87 1 1 440 442 0 0 ,"
"Convolution Conv_88 1 1 442 444 256 1 256 3 3 1 1 1 1 1 -1 1 1 ,"
"PReLU PRelu_90 1 1 444 446 0 0 ,"
"Convolution Conv_91 1 1 446 448 1 256 128 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_93 2 1 438 448 449 ,"
"Convolution Conv_94 1 1 449 451 1 128 256 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU PRelu_96 1 1 451 453 0 0 ,"
"Convolution Conv_97 1 1 453 455 256 1 256 3 3 1 1 1 1 1 -1 1 1 ,"
"PReLU PRelu_99 1 1 455 457 0 0 ,"
"Convolution Conv_100 1 1 457 459 1 256 128 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_102 2 1 449 459 460 ,"
"Convolution Conv_103 1 1 460 462 1 128 256 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU PRelu_105 1 1 462 464 0 0 ,"
"Convolution Conv_106 1 1 464 466 256 1 256 3 3 1 1 1 1 1 -1 1 1 ,"
"PReLU PRelu_108 1 1 466 468 0 0 ,"
"Convolution Conv_109 1 1 468 470 1 256 128 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_111 2 1 460 470 471 ,"
"Convolution Conv_112 1 1 471 473 1 128 512 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU PRelu_114 1 1 473 475 0 0 ,"
"Convolution Conv_115 1 1 475 477 512 1 512 3 3 2 2 1 1 1 -1 1 1 ,"
"PReLU PRelu_117 1 1 477 479 0 0 ,"
"Convolution Conv_118 1 1 479 481 1 512 128 1 1 1 1 0 0 1 -1 1 1 ,"
"Convolution Conv_120 1 1 481 483 1 128 256 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU PRelu_122 1 1 483 485 0 0 ,"
"Convolution Conv_123 1 1 485 487 256 1 256 3 3 1 1 1 1 1 -1 1 1 ,"
"PReLU PRelu_125 1 1 487 489 0 0 ,"
"Convolution Conv_126 1 1 489 491 1 256 128 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_128 2 1 481 491 492 ,"
"Convolution Conv_129 1 1 492 494 1 128 256 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU PRelu_131 1 1 494 496 0 0 ,"
"Convolution Conv_132 1 1 496 498 256 1 256 3 3 1 1 1 1 1 -1 1 1 ,"
"PReLU PRelu_134 1 1 498 500 0 0 ,"
"Convolution Conv_135 1 1 500 502 1 256 128 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_137 2 1 492 502 503 ,"
"Convolution Conv_138 1 1 503 505 1 128 512 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU PRelu_140 1 1 505 507 0 0 ,"
"Convolution Conv_141 1 1 507 509 512 1 512 7 7 1 1 0 0 1 -1 1 1 ,"
"Reshape Reshape_148 1 1 509 517 0 4 4 0 -1 1 1 ,"
"InnerProduct MatMul_149 1 1 517 519 512 1 0 1 ,"
"BatchNormCxx BatchNormalization_150 1 1 519 520 ,"
"ReduceL2 ReduceL2_151 1 1 520 521 1 1 ,"
"Div Div_152 2 1 520 521 output1 ,"
